Repository: cmendible/Hexa.Core
Catalog: Hexa.Core/Resources/Resource.*.resx
Languages: es

source: An object of type {0} was not available from the pool
es: No hay objetos del tipo {0} disponibles en el pool

source: Can not directly save a child object
es: No se puede guardar directamente un objeto del tipo Child

source: Code: {0} was not present in data set collection
es: El codigo: {0} no esta presente en la coleccion.

source: Code Field Name not specified. Unable to Fetch by code.
es: El nombre del campo codigo no esta definido. Imposible realizar la busqueda por codigo.

source: Could not CreateType
es: No se pudo crear el tipo.

source: Could not DefineType
es: No se pudo definir el tipo.

source: Could not generate assembly:
es: No se pudo generar el assembly:

source: Could not generate module builder
es: No se pudo generar el constructor del modulo.

source: creationTimeout cannot be negative
es: creationTimeout debe ser positivo.

source: DataLayerService can't be null.
es: DataLayerService no puede ser nulo.

source: Error: Master Objects Can Not support ChildDelete Method
es: Error: los objetos Master Objects no soportan el metodo ChildDelete.

source: Error Reading Field: {0} form the Data Source.
es: Error al leer el campo: {0} del data source.

source: Identity can not be null.
es: Identity no puede ser nulo

# IEndpointBehaviorTypeSpecifiedMustHaveAPublicEmptyConstructor
source: IEndpointBehaviorType specified in the FlatWsdlServiceBehaviorAttribute constructor must have a public empty constructor.
es: El IEndpointBehaviorType especificado en el atributo FlatWsdlServiceBehaviorAttribute debe tener un constructor publico y vacio.

# InvalidConnectionStringId
source: Invalid ConnectionStringId ({0})
es: Cadena de conexion invalida ({0})

# IsRequired
source: {0} is required
es: {0} es requerido

source: LinqEntityAttribute not defined.
es: No se ha definido el attributo LinqEntityAttribute.

source: maxPoolSize cannot be negative
es: maxPoolSize debe ser positivo

source: minPoolSize cannot be greater than maxPoolSize
es: minPoolSize no puede ser mayor quemaxPoolSize

source: minPoolSize cannot be negative
es: minPoolSize debe ser positivo

# MustBeGreaterOrEqualThan1
source: {0} must be greater or equal than {1}
es: {0} debe ser mayor o igual a {1}

source: Name cannot be null.
es: Name nio puede ser nulo.

source: Object is not Child and can not be saved
es: El objeto no es Child y no puede ser guardado.

source: Object is not valid and can not be saved
es: El objeto no es válido y no puede ser guardado.

source: Object is still being edited and can not be saved
es: El objeto un se esta editando y no puede ser guardado

source: page must be greater or equal to 1
es: page debe ser mayor o igual a 1

# Type0CannotBeUnregisteredBecauseThereAreActiveThreadsWaitingForAnObject
source: The type {0} cannot be unregistered because there are active threads waiting for an object.
es: El tipo {0} no puede ser eliminado del registro ya que existen peticiones pendientes.

source: Type {0} is not registered in the object pool.
es: El tipo {0} no se encuentra registrado en el pool.

source: Type cannot be null.
es: Type no puede ser nulo.

# TypeIsAlreadyRegisteredInTheObjectPool
source: Type {0} is already registered in the object pool
es: El tipo {0} ya se encuentra registrado en el pool.

source: Unable to read key or iv.
es: Error al leer el key o iv.

source: Unable to start provider
es: Error al inicializar el proveedor.

# ValueIsNotAnEmail
source: {0} value is not an email
es: El valor de {0} no es un email

# ValueIsNotCorrectlyFormatted
source: {0} value is not correctly formatted
es: El valor de {0} no tiene el formato correcto

# ValueIsNotOfTheCorrectType
source: {0} value is not of the correct type
es: El valor de {0} no es del tipo de datos correcto

# ValueMustBeBetween1And2
source: {0} value must be between {1} and {2}
es: El valor de {0} debe estar entre {1} y {2}
